DiplomArs4/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomArs4/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomArs4/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АбоненскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗаВыполненныеРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыставленоКлиенту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomArs4/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DiplomArs4/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

DiplomArs4/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора КАК ВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_НачалоДействияДоговора КАК НачалоДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ОкончаниеДействияДоговора КАК ОкончаниеДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
	|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
	|		ПО ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиентов.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиентов.Клиент,
	|	ВКМ_ОбслуживаниеКлиентов.Договор,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_НачалоДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ОкончаниеДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы,
	|	ВКМ_ОбслуживаниеКлиентов.Специалист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот) КАК ПроцентОтРаботСпециалиста,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ДанныеОплатыСпециалиста
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|			&Дата,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					ВТ_ДанныеДокумента.Специалист КАК Специалист
	|				ИЗ
	|					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Клиент КАК Клиент,
	|	ВТ_ДанныеДокумента.Договор КАК Договор,
	|	ВТ_ДанныеДокумента.ВидДоговора КАК ВидДоговора,
	|	ВТ_ДанныеДокумента.НачалоДействияДоговора КАК НачалоДействияДоговора,
	|	ВТ_ДанныеДокумента.ОкончаниеДействияДоговора КАК ОкончаниеДействияДоговора,
	|	ВТ_ДанныеДокумента.СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ВТ_ДанныеДокумента.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВТ_ДанныеДокумента.Специалист КАК Специалист,
	|	ВТ_ДанныеОплатыСпециалиста.ПроцентОтРаботСпециалиста КАК ПроцентОтРаботСпециалиста
	|ИЗ
	|	ВТ_ДанныеОплатыСпециалиста КАК ВТ_ДанныеОплатыСпециалиста
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ПО (ВТ_ДанныеДокумента.Специалист = ВТ_ДанныеОплатыСпециалиста.Сотрудник)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо выбрать договор: Абоненское обслуживание.";
			Сообщение.Сообщить();
			Отказ = Истина;
			
		КонецЕсли;
		
		Если Дата > Выборка.ОкончаниеДействияДоговора Или Дата < Выборка.НачалоДействияДоговора Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата документа, не соответствует, периоду действия договора Абоненского обслуживания.";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		//ПроцентОтРаботСпециалиста - тип строка,  если не установлен, документ не проводится,
		//если установлен, то приводится к числу, так как процент может быть равен 0
		Если Не ЗначениеЗаполнено(Выборка.ПроцентОтРаботСпециалиста) Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не установлен процент отплаты специалисту: %1. Проведение документа не возможно.", Выборка.Специалист);
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе ПроцентОтРаботСпециалиста = Число(Выборка.ПроцентОтРаботСпециалиста);
			
		КонецЕсли;
		
		// Регистр  ВКМ_ВыполненныеКлиентуРаботы
		Если ВыполненныеРаботы.Количество() <> 0 Тогда
			
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Клиент = Выборка.Клиент;
			Движение.Договор = Выборка.Договор;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
			Движение.СуммаЗаВыполненныеРаботы = Движение.КоличествоЧасов * Выборка.СтоимостьЧасаРаботы;
			
		Иначе Продолжить; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Регистр ВКМ_ВыполненныеСотрудникомРаботы 
	Если ВыполненныеРаботы.Количество() <> 0 Тогда
		
		СуммаКОплате = Движение.СуммаЗаВыполненныеРаботы;
		ЧасовКОплате = Движение.КоличествоЧасов;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ЧасовКОплате;
		Движение.СуммаКОплате = СуммаКОплате / 100 * ПроцентОтРаботСпециалиста;
		
	Иначе Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат; 
    КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		
		УведомлениеИзмененногоОбслуживаниеКлиента();
		
	КонецЕсли;
	
		ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
        Возврат; 
    КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
	
	НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовоеСообщение.ТекстСообщения = СтрШаблон("Новая Заявка № %1, Клиент: %2. Дата проведения работ: %3. Время начала: %4. Время окончания:%5. Специалист: %6",
		Номер,
		Клиент,
		Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"),
		Формат(ВремяНачалаРабот,"ДЛФ=T"),
		Формат(ВремяОкончанияРабот, "ДЛФ=T"), 
		Специалист); 
	
	НовоеСообщение.Записать();
	
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УведомлениеИзмененногоОбслуживаниеКлиента()
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Специалист <> Выборка.Специалист Тогда
				СообщСпециалист  = Специалист;
			Иначе
				СообщСпециалист = Выборка.Специалист;
			КонецЕсли;
			
			Если ДатаПроведенияРабот <> Выборка.ДатаПроведенияРабот Тогда
				СообщДатаПроведенияРабот = ДатаПроведенияРабот;
			Иначе
				СообщДатаПроведенияРабот = Выборка.ДатаПроведенияРабот;
			КонецЕсли;
			
			Если ВремяНачалаРабот <> Выборка.ВремяНачалаРабот Тогда
				СообщВремяНачалаРабот = ВремяНачалаРабот;
			Иначе
				СообщВремяНачалаРабот = Выборка.ВремяНачалаРабот;
			КонецЕсли;
			
			Если ВремяОкончанияРабот <> Выборка.ВремяОкончанияРабот Тогда   
				СообщВремяОкончанияРабот = ВремяОкончанияРабот;
			Иначе
				СообщВремяОкончанияРабот = Выборка.ВремяОкончанияРабот;
			КонецЕсли;
			
		КонецЦикла;
		
		СообщениеИзменение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		СообщениеИзменение.ТекстСообщения = СтрШаблон("Внимание! По Заявке № %1, Клиент: %2,внесены изменения. Дата проведения работ: %3. Время начала: %4. Время окончания: %5. Специалист: %6",						
			Номер,
			Клиент,
			Формат(СообщДатаПроведенияРабот,"ДФ=dd.MM.yyyy"), 
			Формат(СообщВремяНачалаРабот,"ДЛФ=T"), 
			Формат(СообщВремяОкончанияРабот, "ДЛФ=T"), 
			СообщСпециалист);
		
		СообщениеИзменение.Записать();
			
КонецПроцедуры

#КонецОбласти
